
import string
from django.http import HttpRequest, HttpResponse
from django.shortcuts import render,redirect
from Main_app.models import Cipher,Decipher
# Create your views here.
def home(request):
    return render(request,'Main_app/home.html')

def encrypt(request):
     cipher =Cipher.objects.all()
     if request.method=='GET':
         return render(request,'Main_app/encrypt.html')
     else:
        p=request.POST['plaintext']  
        Cipher.objects.create(Plaintext=p)
        return redirect ('submit')  


def decrypt(request):
     cipher =Cipher.objects.all()
     if request.method=='GET':
         return render(request,'Main_app/decrypt.html')
     else:
        p=request.POST['plaintext']  
        Cipher.objects.create(Plaintext=p)
        return redirect ('submitt')  

def submitt(request):
    ciphers =Cipher.objects.all()
    return render(request,'main_app/submitt.html',{'ciphers': ciphers})      

def submit(request):
    ciphers =Cipher.objects.all()
    return render(request,'main_app/submit.html',{'ciphers': ciphers})    


def process(request,id):
    ciphh=Cipher.objects.get(id=id)
    import string
    def encrypt():
        plaintext=ciphh.Plaintext
        alphabets=["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"," ","z","e","b","r","a", "i","s", "t", "p","d", "c", "f","g", "h", "j","k", "l", "m","n", "o", "q","u", "v", "w","x", "y","अ","इ","उ","ए","क","का","कि","ख","ग","घ","ङ","च","छ","ज","झ","ञ","ट","ठ","ड","ढ","ण","त","थ","द","ध","न","फ","ब","भ","म","य","र","ल","व","श","ह","ऺ","ऻ","़","ऽ","ा","ि","ी","ु","ू","ृ","ॄ","ॅ","ॆ","े","ै","ॉ","ॊ","ो","ौ","्","ॎ","ॏ","ॐ","॑","॒","॓","॔","ॕ","ॗ","१","२","३","४","५","६","७","८","९"]
        key=["N","O","P","Q","R","Y","Z","D","E","F","G","H","I","J","K","L","M"," ", "p","S","T","U","V","A","B","C","W","X","d", "c", "f","g", "h", "j","k","m","n", "o", "q","u", "v", "w","x", "y", "l","z","e","b","r","a", "i","s", "t","ज","झ","ञ","ट","ठ","ड","ढ","ण","त","थ","द","ध","न","फ","१","२","३","४","५","६","७","८","९","ब","भ","म","य","र","ल","व","श","ह","ऺ","ऻ","़","ऽ","ा","ि","ी","ु","ॊ","ो","ॐ","॑","॒","॓","॔","ॕ","ॗ","ौ","्","ॎ","ॏ","ू","ृ","ॄ","ॅ","ॆ","े","ै","ॉ","क","का","कि","ख","ग","घ","ङ","च","छ","अ","इ","उ","ए",]
        cipher =[]
        for c in plaintext:
            if c==" ":
                cipher.append(c)
            else:    
                index= alphabets.index(c)
                cipher.append(key[index])
        return cipher        
        # print(" ".join(cipher))        
        # print(cipher.index() ) 
    f=" ".join(encrypt()) 
    return render(request,'Main_app/answer.html',{'answer':f }) 

    # def encrypt():
    #     plaintext = ciphh.Plaintext
    #     alphabets=["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"," ","z","e","b","r","a", "i","s", "t", "p","d", "c", "f","g", "h", "j","k", "l", "m","n", "o", "q","u", "v", "w","x", "y","अ","आ","इ","ई","उ","ऊ","ए","ऐ","ओ","औ","अं","अः","क","का","कि","की","कु","कू","के","कै","को","कौ","कं","कः","ख","खा","खि","खी","खु","खू","खे","खै","खो","खौ","खं","खः","ग","गा","गि","गी","गु","गू","गे","गै","गो","गौ","गं","गः","घ","घा","घि","घी","घु","घू","घे","घै","घो","घौ","घं","घः","ङ","ङा","ङि","ङी","ङु","ङू","ङे","ङै","ङो","ङौ","ङं","ङः","च","चा","चि","ची","चु","चू","चे","चै","चो","चौ","चं","चः","छ","छा","छि","छी","छु","छू","छे","छै","छो","छौ","छं","छः","ज","जा","जि","जी","जु","जू","जे","जै","जो","जौ","जं","जः","झ","झा","झि","झी","झु","झू","झे","झै","झो","झौ","झं","झः","ञ","ञा","ञि","ञी","ञु","ञू","ञे","ञै","ञो","ञौ","ञं","ञः","ट","टा","टि","टी","टु","टू","टे","टै","टो","टौ","टं","टः","ठ","ठा","ठि","ठी","ठु","ठू","ठे","ठै","ठो","ठौ","ठं","ठः","ड","डा","डि","डी","डु","डू","डे","डै","डो","डौ","डं","डः","ढ","ढा","ढि","ढी","ढु","ढू","ढे","ढै","ढो","ढौ","ढं","ढः","ण","णा","णि","णी","णु","णू","णे","णै","णो","णौ","णं","णः","त","ता","ति","ती","तु","तू","ते","तै","तो","तौ","तं","तः","थ","था","थि","थी","थु","थू","थे","थै","थो","थौ","थं","थः","द","दा","दि","दी","दु","दू","दे","दै","दो","दौ","दं","दः","ध","धा","धि","धी","धु","धू","धे","धै","धो","धौ","धं","धः","न","ना","नि","नी","नु","नू","ने","नै","नो","नौ","नं","प","पा","पि","पी","पु","पू","पे","पै","पो","पौ","पं","फ","फा","फि","फी","फु","फू","फे","फै","फो","फौ","फं","ब","बा","बि","बी","बु","बू","बे","बै","बो","बौ","बं","भ","भा","भि","भी","भु","भू","भे","भै","भो","भौ","भं","म","मा","मि","मी","मु","मू","मे","मै","मो","मौ","मं","य","या","यि","यी","यु","यू","ये","यै","यो","यौ","यं","र","रा","रि","री","रु","रू","रे","रै","रो","रौ","रं","ल","ला","लि","ली","लु","लू","ले","लै","लो","लौ","लं","व","वा","वि","वी","वु","वू","वे","वै","वो","वौ","वं","श","शा","शि","शी","शु","श","शे","शै","शो","शौ","शं","ष","षा","षि","षी","षु","षू","षे","षै","षो","षौ","षं","स","सा","सि","सी","सु","सू","से","सै","सो","सौ","सं","ह","हा","हि","ही","हु","हू","हे","है","हो","हौ","हं"]
    #     key=[" ","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z","A","B","C","D","E","F","G","H","I","J","K","L","g", "h", "j","k", "l", "m","n", "o", "q","u", "v", "w","x", "y","z","e","b","r","a", "i","s", "t", "p","d", "c", "f","पं","फ","फा","फि","फी","फु","फू","फे","फै","फो","फौ","फं","ब","बा","बि","बी","बु","बू","बे","बै","बो","बौ","बं","भ","भा","भि","भी","भु","भू","भे","भै","भो","भौ","भं","म","मा","मि","मी","मु","मू","मे","मै","मो","मौ","मं","य","या","यि","यी","यु","यू","ये","यै","यो","यौ","यं","र","रा","रि","री","रु","रू","रे","रै","रो","रौ","रं","ल","ला","लि","ली","लु","लू","ले","लै","लो","लौ","लं","व","वा","वि","वी","वु","वू","वे","वै","वो","वौ","वं","श","शा","शि","शी","शु","श","शे","शै","शो","शौ","शं","ष","षा","षि","षी","षु","षू","षे","षै","षो","षौ","षं","स","सा","सि","सी","सु","सू","से","सै","सो","सौ","सं","ह","हा","हि","ही","हु","हू","हे","है","हो","हौ","हं","न","ना","नि","नी","नु","नू","ने","नै","नो","नौ","नं","प","पा","पि","पी","पु","पू","पे","पै","पो","पौ","अ","आ","इ","ई","उ","ऊ","ए","ऐ","ओ","औ","अं","अः","क","का","कि","की","कु","कू","के","कै","को","कौ","कं","कः","ख","खा","खि","खी","खु","खू","खे","खै","खो","खौ","खं","खः","ग","गा","गि","गी","गु","गू","गे","गै","गो","गौ","गं","गः","घ","घा","घि","घी","घु","घू","घे","घै","घो","घौ","घं","घः","ङ","ङा","ङि","ङी","ङु","ङू","ङे","ङै","ङो","ङौ","ङं","ङः","च","चा","चि","ची","चु","चू","चे","चै","चो","चौ","चं","चः","छ","छा","छि","छी","छु","छू","छे","छै","छो","छौ","छं","छः","ज","जा","जि","जी","जु","जू","जे","जै","जो","जौ","जं","जः","झ","झा","झि","झी","झु","झू","झे","झै","झो","झौ","झं","झः","ञ","ञा","ञि","ञी","ञु","ञू","ञे","ञै","ञो","ञौ","ञं","ञः","ट","टा","टि","टी","टु","टू","टे","टै","टो","टौ","टं","टः","ठ","ठा","ठि","ठी","ठु","ठू","ठे","ठै","ठो","ठौ","ठं","ठः","ड","डा","डि","डी","डु","डू","डे","डै","डो","डौ","डं","डः","ढ","ढा","ढि","ढी","ढु","ढू","ढे","ढै","ढो","ढौ","ढं","ढः","ण","णा","णि","णी","णु","णू","णे","णै","णो","णौ","णं","णः","त","ता","ति","ती","तु","तू","ते","तै","तो","तौ","तं","तः","थ","था","थि","थी","थु","थू","थे","थै","थो","थौ","थं","थः","द","दा","दि","दी","दु","दू","दे","दै","दो","दौ","दं","दः","ध","धा","धि","धी","धु","धू","धे","धै","धो","धौ","धं","धः"]
    #     cipher =[]
    #     for c in plaintext:
    #         if c==" ":
    #             cipher.append(c)
    #         else:    
    #             index= alphabets.index(c)
    #             cipher.append(key[index])
    #     return cipher        
    #     # print(" ".join(cipher))        
    #     # print(cipher.index() ) 
    # f=" ".join(encrypt())          
    # return render(request,'Main_app/answer.html',{'answer':f }) 



def processs(request,id):
    ciphh=Cipher.objects.get(id=id)

    def decrypt():
        ciphertext =ciphh.Plaintext
        alphabets=["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"," ","z","e","b","r","a", "i","s", "t", "p","d", "c", "f","g", "h", "j","k", "l", "m","n", "o", "q","u", "v", "w","x", "y","अ","इ","उ","ए","क","का","कि","ख","ग","घ","ङ","च","छ","ज","झ","ञ","ट","ठ","ड","ढ","ण","त","थ","द","ध","न","फ","ब","भ","म","य","र","ल","व","श","ह","ऺ","ऻ","़","ऽ","ा","ि","ी","ु","ू","ृ","ॄ","ॅ","ॆ","े","ै","ॉ","ॊ","ो","ौ","्","ॎ","ॏ","ॐ","॑","॒","॓","॔","ॕ","ॗ","१","२","३","४","५","६","७","८","९"]
        key=["N","O","P","Q","R","Y","Z","D","E","F","G","H","I","J","K","L","M"," ", "p","S","T","U","V","A","B","C","W","X","d", "c", "f","g", "h", "j","k","m","n", "o", "q","u", "v", "w","x", "y", "l","z","e","b","r","a", "i","s", "t","ज","झ","ञ","ट","ठ","ड","ढ","ण","त","थ","द","ध","न","फ","१","२","३","४","५","६","७","८","९","ब","भ","म","य","र","ल","व","श","ह","ऺ","ऻ","़","ऽ","ा","ि","ी","ु","ॊ","ो","ॐ","॑","॒","॓","॔","ॕ","ॗ","ौ","्","ॎ","ॏ","ू","ृ","ॄ","ॅ","ॆ","े","ै","ॉ","क","का","कि","ख","ग","घ","ङ","च","छ","अ","इ","उ","ए",]

        plain =""
        for c in ciphertext:
            if c==" ":
                plain=plain+c
            else:    
                index= key.index(c)
                plain= plain + alphabets[index] 
        return(plain)    
    f=decrypt()    
    return render(request,'Main_app/answer.html',{'answer':f }) 

    # def decrypt():
    #     ciphertext =ciphh.Plaintext
    #     alphabets=["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"," ","z","e","b","r","a", "i","s", "t", "p","d", "c", "f","g", "h", "j","k", "l", "m","n", "o", "q","u", "v", "w","x", "y","अ","आ","इ","ई","उ","ऊ","ए","ऐ","ओ","औ","अं","अः","क","का","कि","की","कु","कू","के","कै","को","कौ","कं","कः","ख","खा","खि","खी","खु","खू","खे","खै","खो","खौ","खं","खः","ग","गा","गि","गी","गु","गू","गे","गै","गो","गौ","गं","गः","घ","घा","घि","घी","घु","घू","घे","घै","घो","घौ","घं","घः","ङ","ङा","ङि","ङी","ङु","ङू","ङे","ङै","ङो","ङौ","ङं","ङः","च","चा","चि","ची","चु","चू","चे","चै","चो","चौ","चं","चः","छ","छा","छि","छी","छु","छू","छे","छै","छो","छौ","छं","छः","ज","जा","जि","जी","जु","जू","जे","जै","जो","जौ","जं","जः","झ","झा","झि","झी","झु","झू","झे","झै","झो","झौ","झं","झः","ञ","ञा","ञि","ञी","ञु","ञू","ञे","ञै","ञो","ञौ","ञं","ञः","ट","टा","टि","टी","टु","टू","टे","टै","टो","टौ","टं","टः","ठ","ठा","ठि","ठी","ठु","ठू","ठे","ठै","ठो","ठौ","ठं","ठः","ड","डा","डि","डी","डु","डू","डे","डै","डो","डौ","डं","डः","ढ","ढा","ढि","ढी","ढु","ढू","ढे","ढै","ढो","ढौ","ढं","ढः","ण","णा","णि","णी","णु","णू","णे","णै","णो","णौ","णं","णः","त","ता","ति","ती","तु","तू","ते","तै","तो","तौ","तं","तः","थ","था","थि","थी","थु","थू","थे","थै","थो","थौ","थं","थः","द","दा","दि","दी","दु","दू","दे","दै","दो","दौ","दं","दः","ध","धा","धि","धी","धु","धू","धे","धै","धो","धौ","धं","धः","न","ना","नि","नी","नु","नू","ने","नै","नो","नौ","नं","प","पा","पि","पी","पु","पू","पे","पै","पो","पौ","पं","फ","फा","फि","फी","फु","फू","फे","फै","फो","फौ","फं","ब","बा","बि","बी","बु","बू","बे","बै","बो","बौ","बं","भ","भा","भि","भी","भु","भू","भे","भै","भो","भौ","भं","म","मा","मि","मी","मु","मू","मे","मै","मो","मौ","मं","य","या","यि","यी","यु","यू","ये","यै","यो","यौ","यं","र","रा","रि","री","रु","रू","रे","रै","रो","रौ","रं","ल","ला","लि","ली","लु","लू","ले","लै","लो","लौ","लं","व","वा","वि","वी","वु","वू","वे","वै","वो","वौ","वं","श","शा","शि","शी","शु","श","शे","शै","शो","शौ","शं","ष","षा","षि","षी","षु","षू","षे","षै","षो","षौ","षं","स","सा","सि","सी","सु","सू","से","सै","सो","सौ","सं","ह","हा","हि","ही","हु","हू","हे","है","हो","हौ","हं"]
    #     key=[" ","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z","A","B","C","D","E","F","G","H","I","J","K","L","g", "h", "j","k", "l", "m","n", "o", "q","u", "v", "w","x", "y","z","e","b","r","a", "i","s", "t", "p","d", "c", "f","पं","फ","फा","फि","फी","फु","फू","फे","फै","फो","फौ","फं","ब","बा","बि","बी","बु","बू","बे","बै","बो","बौ","बं","भ","भा","भि","भी","भु","भू","भे","भै","भो","भौ","भं","म","मा","मि","मी","मु","मू","मे","मै","मो","मौ","मं","य","या","यि","यी","यु","यू","ये","यै","यो","यौ","यं","र","रा","रि","री","रु","रू","रे","रै","रो","रौ","रं","ल","ला","लि","ली","लु","लू","ले","लै","लो","लौ","लं","व","वा","वि","वी","वु","वू","वे","वै","वो","वौ","वं","श","शा","शि","शी","शु","श","शे","शै","शो","शौ","शं","ष","षा","षि","षी","षु","षू","षे","षै","षो","षौ","षं","स","सा","सि","सी","सु","सू","से","सै","सो","सौ","सं","ह","हा","हि","ही","हु","हू","हे","है","हो","हौ","हं","न","ना","नि","नी","नु","नू","ने","नै","नो","नौ","नं","प","पा","पि","पी","पु","पू","पे","पै","पो","पौ","अ","आ","इ","ई","उ","ऊ","ए","ऐ","ओ","औ","अं","अः","क","का","कि","की","कु","कू","के","कै","को","कौ","कं","कः","ख","खा","खि","खी","खु","खू","खे","खै","खो","खौ","खं","खः","ग","गा","गि","गी","गु","गू","गे","गै","गो","गौ","गं","गः","घ","घा","घि","घी","घु","घू","घे","घै","घो","घौ","घं","घः","ङ","ङा","ङि","ङी","ङु","ङू","ङे","ङै","ङो","ङौ","ङं","ङः","च","चा","चि","ची","चु","चू","चे","चै","चो","चौ","चं","चः","छ","छा","छि","छी","छु","छू","छे","छै","छो","छौ","छं","छः","ज","जा","जि","जी","जु","जू","जे","जै","जो","जौ","जं","जः","झ","झा","झि","झी","झु","झू","झे","झै","झो","झौ","झं","झः","ञ","ञा","ञि","ञी","ञु","ञू","ञे","ञै","ञो","ञौ","ञं","ञः","ट","टा","टि","टी","टु","टू","टे","टै","टो","टौ","टं","टः","ठ","ठा","ठि","ठी","ठु","ठू","ठे","ठै","ठो","ठौ","ठं","ठः","ड","डा","डि","डी","डु","डू","डे","डै","डो","डौ","डं","डः","ढ","ढा","ढि","ढी","ढु","ढू","ढे","ढै","ढो","ढौ","ढं","ढः","ण","णा","णि","णी","णु","णू","णे","णै","णो","णौ","णं","णः","त","ता","ति","ती","तु","तू","ते","तै","तो","तौ","तं","तः","थ","था","थि","थी","थु","थू","थे","थै","थो","थौ","थं","थः","द","दा","दि","दी","दु","दू","दे","दै","दो","दौ","दं","दः","ध","धा","धि","धी","धु","धू","धे","धै","धो","धौ","धं","धः"]
    #     plain =""
    #     for c in ciphertext:
    #         if c==" ":
    #             plain=plain+c
    #         else:    
    #             index= key.index(c)
    #             plain= plain + alphabets[index] 
    #     return(plain)    
    # f=decrypt()    
    # return render(request,'Main_app/answer.html',{'answer':f }) 





        
def delete_all(request):
    todo=Cipher.objects.all().delete()
    return redirect('home')     
# def ok(request):
#     Cipher.objects.all().delete() 
#     return redirect('home')      